# GenericRefractionIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic..::..GenericRefractionIndex Property
Generic Class See Also
---
The property labeled "Refraction" from the "Generic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GenericRefractionIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericRefractionIndex As String
	Get
```

Visual C++
---
```text
public:
static property String^ GenericRefractionIndex {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
# See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace